sfr WKTCL = 0xaa;                   //掉电唤醒定时器计时低字节
sfr WKTCH = 0xab;                   //掉电唤醒定时器计时高字节

sbit P10 = P1^0;

//-----------------------------------------------

void main()
{
    WKTCL = 49;                     //设置唤醒周期为488us*(49+1) = 24.4ms
    WKTCH = 0x80;                   //使能掉电唤醒定时器
    
    while (1)
    {
        PCON = 0x02;                //进入掉电模式
        _nop_();                    //掉电模式被唤醒后,直接从此语句开始向下执行,不进入中断服务程序
        _nop_();
        P10 = !P10;                 //掉电唤醒后,取反测试口
    }
}


sfr P4M1 = 0xb3;
sfr P4M0 = 0xb4;